## Requirements

In [10]:
import pandas as pd
from sqlalchemy import create_engine, text
# pip install psycopg2

---
---
---

## Connecting

In [11]:
# 'postgresql://{user}:{password}@{host}:{port}/{db}'
engine = create_engine('postgresql://root:root@localhost:5432/My_Database')
connection = engine.connect()

---
---
---

## Database tables

In [12]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,body_fat,root,None,False,False,False,False
1,public,Jena_climate,root,None,False,False,False,False
2,public,customer_data,root,None,False,False,False,False
3,public,madrid_houses,root,None,False,False,False,False
4,public,alumnos,root,None,False,False,False,False
5,public,profesores,root,None,False,False,False,False
6,public,examenes,root,None,False,False,False,False

In [13]:
query = """
SELECT table_schema, table_name
FROM information_schema.tables
WHERE table_schema = 'public'
ORDER BY table_schema, table_name;
"""

pd.read_sql(query, con=engine)

  table_schema     table_name
0       public   Jena_climate
1       public        alumnos
2       public       body_fat
3       public  customer_data
4       public       examenes
5       public  madrid_houses
6       public     profesores

---
---
---

## SQL Operations

### Create new tables

#### Using SQL

In [55]:
# Sentencias SQL para crear las tablas usando text()

create_alumnos_table = text("""
CREATE TABLE IF NOT EXISTS alumnos (
    alumno_id VARCHAR(50) PRIMARY KEY,
    nombre TEXT,
    apellido TEXT,
    edad INTEGER,
    grado INTEGER
);
""")

create_profesores_table = text("""
CREATE TABLE IF NOT EXISTS profesores (
    profesor_id VARCHAR(50) PRIMARY KEY,
    nombre VARCHAR(50),
    apellido VARCHAR(50),
    materia VARCHAR(50)
);
""")

create_examenes_table = text("""
CREATE TABLE IF NOT EXISTS examenes (
    examen_id VARCHAR(50) PRIMARY KEY,
    alumno_id VARCHAR(50),
    profesor_id VARCHAR(50),
    nota DECIMAL(5,2),
    fecha DATE,
    FOREIGN KEY(alumno_id) REFERENCES alumnos(alumno_id),
    FOREIGN KEY(profesor_id) REFERENCES profesores(profesor_id)
);
""")

# Ejecutar las sentencias SQL para crear las tablas
connection.execute(create_alumnos_table)
connection.execute(create_profesores_table)
connection.execute(create_examenes_table)

print("Tablas creadas exitosamente.")

Tablas creadas exitosamente.

In [56]:
# Sentencias SQL para insertar registros en las tablas usando text()
insert_alumnos = text("""
INSERT INTO alumnos (alumno_id, nombre, apellido, edad, grado) VALUES
('a1', 'Juan', 'Pérez', 15, 10),
('a2', 'María', 'Gómez', 14, 9),
('a3', 'Carlos', 'Sánchez', 16, 11),
('a4', 'Lucía', 'Fernández', 17, 12),
('a5', 'Andrés', 'Martínez', 15, 10);
""")

insert_profesores = text("""
INSERT INTO profesores (profesor_id, nombre, apellido, materia) VALUES
('p1', 'Ana', 'López', 'Matemáticas'),
('p2', 'Luis', 'Rodríguez', 'Historia'),
('p3', 'Elena', 'Martínez', 'Ciencias'),
('p4', 'Manuel', 'González', 'Inglés'),
('p5', 'Rosa', 'Torres', 'Educación Física');
""")

insert_examenes = text("""
INSERT INTO examenes (examen_id, alumno_id, profesor_id, nota, fecha) VALUES
('e1', 'a1', 'p1', 8.5, '2024-05-10'),
('e2', 'a3', 'p3', 9.0, '2024-05-11'),
('e3', 'a1', 'p1', 7.8, '2024-05-12'),
('e4', 'a2', 'p4', 8.8, '2024-05-13'),
('e5', 'a2', 'p3', 9.2, '2024-05-14'),
('e6', 'a1', 'p3', 8.1, '2024-06-10'),
('e7', 'a5', 'p2', 8.9, '2024-06-11');
""")

# Ejecutar las sentencias SQL para insertar los registros
connection.execute(insert_alumnos)
connection.execute(insert_profesores)
connection.execute(insert_examenes)
 
print("Registros insertados exitosamente.")

Registros insertados exitosamente.

In [57]:
connection.commit()

print("Cambios comprometidos (commited)")

Cambios comprometidos (commited)

#### Using data ingestion script

Explained directly in the course in a visual and practical way.

---
---
---

### Delete tables

- If the tables proposed to be deleted have non dependency --> No problem
- Otherwise --> Problem

In [ ]:
tables_to_drop = ['alumnos', 'profesores', 'examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Assuming that the tables that we want to delete have a dependency among them. 

Alternatives to delete all of them:

- Dropping the dependent table

In [45]:
tables_to_drop = ['examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla examenes eliminada exitosamente.
Cambios comprometidos (commited)

In [46]:
tables_to_drop = ['alumnos', 'profesores']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name};")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla alumnos eliminada exitosamente.
Tabla profesores eliminada exitosamente.
Cambios comprometidos (commited)

- Dropping in cascade

In [59]:
tables_to_drop = ['alumnos', 'profesores', 'examenes']

for table_name in tables_to_drop:
    
    # Sentencia SQL para eliminar la tabla 'table_name'
    drop_table_query = text(f"DROP TABLE IF EXISTS {table_name} CASCADE;")

    # Ejecutar la sentencia SQL para eliminar la tabla
    connection.execute(drop_table_query)

    print(f"Tabla {table_name} eliminada exitosamente.")

connection.commit()
print("Cambios comprometidos (commited)")

Tabla alumnos eliminada exitosamente.
Tabla profesores eliminada exitosamente.
Tabla examenes eliminada exitosamente.
Cambios comprometidos (commited)

---
---
---

## Full view of a table

In [14]:
query = """
SELECT * FROM madrid_houses;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1
3,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
4,4,21738,108.0,2,2,1,0.0,4,260000,False,True,True,0,True,133,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21734,21737,5,78.0,2,2,1,0.0,4,350000,False,True,True,0,True,10,2,5
21735,21738,4,96.0,2,2,1,0.0,3,425000,False,True,True,0,True,9,2,1
21736,21739,3,175.0,4,2,1,0.0,-1,680000,False,False,True,3,True,9,2,1
21737,21740,2,289.0,4,3,3,304.0,-5,695000,False,False,True,0,True,9,2,2
21738,21741,1,72.0,2,2,1,0.0,2,424000,False,True,True,7,True,3,1,1

In [28]:
query = """
SELECT * FROM alumnos;
"""

pd.read_sql(query, con=engine)

  alumno_id  nombre   apellido  edad       DNI
0        a1    Juan      Pérez    15   505023X
1        a2   María      Gómez    14   654578J
2        a3  Carlos    Sánchez    16   101545B
3        a4   Lucía  Fernández    17   202541X
4        a5  Andrés   Martínez    15  5305023W

---
---
---

## Partial view of a table

In [16]:
query = """
SELECT * FROM madrid_houses LIMIT 7;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1
3,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
4,4,21738,108.0,2,2,1,0.0,4,260000,False,True,True,0,True,133,21,1
5,5,21737,126.0,4,2,1,0.0,3,195000,False,False,True,0,True,134,21,1
6,6,21736,120.0,5,2,1,0.0,1,190000,False,False,True,2,True,134,21,1

In [17]:
query = """
SELECT * FROM madrid_houses LIMIT 3;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1

---
---
---

## Number of rows

In [18]:
query = """
SELECT COUNT(*) FROM madrid_houses;
"""

pd.read_sql(query, con=engine)

   count
0  21739

---
---
---

## Select columns from a table

In [19]:
query = """
SELECT n_rooms, n_bathrooms, buy_price, sq_mt_built  
FROM madrid_houses ;
"""

pd.read_sql(query, con=engine)

       n_rooms  n_bathrooms  buy_price  sq_mt_built
0            2            1      85000         64.0
1            3            1     129900         70.0
2            2            2     144247         94.0
3            2            1     109900         64.0
4            2            2     260000        108.0
...        ...          ...        ...          ...
21734        2            2     350000         78.0
21735        2            2     425000         96.0
21736        4            2     680000        175.0
21737        4            3     695000        289.0
21738        2            2     424000         72.0

[21739 rows x 4 columns]

In [49]:
query = """
SELECT nombre, "DNI"
FROM alumnos;
"""

pd.read_sql(query, con=engine)

   nombre       DNI
0    Juan   505023X
1   María   654578J
2  Carlos   101545B
3   Lucía   202541X
4  Andrés  5305023W

In [48]:
query = """
SELECT nombre, DNI
FROM alumnos;
"""

pd.read_sql(query, con=engine)

ProgrammingError: (psycopg2.errors.UndefinedColumn) column "dni" does not exist
LINE 2: SELECT nombre, DNI
                       ^

[SQL:
SELECT nombre, DNI
FROM alumnos;
]
(Background on this error at: https://sqlalche.me/e/20/f405)

---
---
---

## Assign an alias to a column

In [51]:
query = """
SELECT buy_price AS price FROM madrid_houses;
"""

pd.read_sql(query, con=engine)

        price
0       85000
1      129900
2      144247
3      109900
4      260000
...       ...
21734  350000
21735  425000
21736  680000
21737  695000
21738  424000

[21739 rows x 1 columns]

---
---
---

## Filtering rows by conditions

In [53]:
query = """
SELECT * FROM madrid_houses WHERE buy_price <= 100000;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,14,21728,64.0,3,1,1,0.0,3,72000,False,False,True,2,False,135,21,1
2,17,21725,65.0,3,1,1,0.0,4,90000,False,False,True,0,False,132,21,1
3,19,21723,60.0,2,1,1,0.0,-1,94900,False,False,True,0,False,135,21,1
4,20,21722,60.0,2,1,1,0.0,2,89900,False,False,True,0,False,134,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
514,21231,511,77.0,3,1,1,0.0,1,100000,False,False,False,0,False,134,21,1
515,21336,406,40.0,1,1,1,0.0,-1,99000,False,False,True,0,False,120,18,1
516,21345,397,50.0,1,1,1,0.0,-1,99900,False,False,True,5,False,119,18,1
517,21415,327,37.0,1,1,1,0.0,1,87000,False,False,False,4,False,90,13,1
518,21430,312,61.0,2,1,1,0.0,-1,95000,False,False,True,0,False,89,13,1

In [54]:
query = """
SELECT sq_mt_built, buy_price FROM madrid_houses 
WHERE buy_price <= 100000;
"""

pd.read_sql(query, con=engine)

     sq_mt_built  buy_price
0           64.0      85000
1           64.0      72000
2           65.0      90000
3           60.0      94900
4           60.0      89900
..           ...        ...
514         77.0     100000
515         40.0      99000
516         50.0      99900
517         37.0      87000
518         61.0      95000

[519 rows x 2 columns]

In [57]:
query = """
SELECT * FROM madrid_houses 
WHERE n_bathrooms > 2 AND sq_mt_built < 100;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,899,20843,74.0,3,3,1,0.0,2,190000,False,False,True,0,False,125,19,1
1,1079,20663,76.0,3,3,1,0.0,1,189000,False,True,True,0,True,124,19,1
2,1602,20140,97.0,2,3,2,0.0,3,225000,False,True,True,0,True,130,20,4
3,2599,19143,95.0,3,3,1,0.0,-1,380000,False,False,True,1,False,113,17,1
4,2688,19054,93.0,2,3,1,0.0,-1,189000,False,False,True,0,False,115,17,1
5,2979,18763,95.0,3,3,2,0.0,-1,410000,False,False,True,0,True,113,17,4
6,2980,18762,83.0,4,3,1,0.0,1,435000,False,True,False,0,False,114,17,1
7,3156,18586,95.0,3,3,1,0.0,0,430000,False,False,True,5,True,113,17,1
8,3269,18473,95.0,3,3,2,0.0,-1,429900,False,False,True,1,True,113,17,4
9,3368,18374,90.0,3,3,1,0.0,1,319000,False,False,True,0,False,111,17,1
10,4224,17518,90.0,3,3,1,0.0,6,489000,False,True,True,0,False,95,14,1
11,4931,16811,89.0,2,3,1,0.0,-1,99000,False,False,True,0,False,85,13,1
12,5482,16260,84.0,2,3,1,0.0,-1,127500,False,False,True,0,False,85,13,1
13,5605,16137,77.0,2,3,2,0.0,-1,127500,True,True,True,0,False,85,13,4
14,5815,15927,94.0,4,3,2,0.0,6,299000,False,True,True,0,False,83,12,4
15,5905,15837,82.0,4,4,1,0.0,1,195000,True,False,True,4,False,81,12,1
16,6238,15504,98.0,2,3,1,0.0,9,275000,False,True,True,5,False,68,10,1
17,6985,14757,83.0,2,3,1,0.0,2,210000,True,True,True,2,False,73,11,1
18,6989,14753,92.0,2,3,2,0.0,2,395000,False,True,True,0,True,72,11,4
19,7241,14501,75.0,2,3,1,0.0,-1,300000,False,True,True,0,False,73,11,1
20,9772,11970,90.0,2,3,2,0.0,3,289000,False,True,True,3,True,61,9,4
21,10997,10745,96.0,5,3,1,0.0,4,550000,False,True,True,3,False,33,6,1
22,13067,8675,70.0,2,3,1,0.0,1,218000,False,False,True,4,False,39,7,1
23,14843,6899,76.0,3,3,1,0.0,4,395000,False,True,True,0,False,30,5,1
24,15798,5944,90.0,2,3,2,30.0,-5,290000,False,False,True,0,False,19,3,2
25,16085,5657,98.0,3,3,1,0.0,5,270000,False,True,True,0,False,19,3,1
26,17046,4696,98.0,3,3,1,0.0,5,270000,False,True,True,0,False,19,3,1
27,17453,4289,90.0,2,3,1,0.0,1,590000,False,True,True,3,False,23,4,1
28,17971,3771,90.0,2,3,1,0.0,1,550000,False,True,True,0,False,23,4,1
29,18106,3636,90.0,2,3,1,0.0,1,550000,False,True,True,5,False,23,4,1
30,18479,3263,69.0,2,3,1,0.0,-1,299000,False,False,False,0,False,22,4,1
31,19784,1958,96.0,2,3,1,0.0,4,498000,False,True,False,0,False,101,15,1
32,21131,611,90.0,4,3,1,0.0,4,299990,False,True,True,3,False,118,18,1
33,21316,426,82.0,3,3,2,0.0,4,399000,False,True,True,0,True,112,17,4
34,21405,337,98.0,4,3,1,0.0,6,299000,False,True,True,0,True,83,12,1
35,21669,73,93.0,3,3,1,0.0,6,640000,False,True,True,3,False,30,5,1

In [58]:
query = """
SELECT n_bathrooms, sq_mt_built, buy_price FROM madrid_houses 
WHERE n_bathrooms > 2 AND sq_mt_built < 100;
"""

pd.read_sql(query, con=engine)

    n_bathrooms  sq_mt_built  buy_price
0             3         74.0     190000
1             3         76.0     189000
2             3         97.0     225000
3             3         95.0     380000
4             3         93.0     189000
5             3         95.0     410000
6             3         83.0     435000
7             3         95.0     430000
8             3         95.0     429900
9             3         90.0     319000
10            3         90.0     489000
11            3         89.0      99000
12            3         84.0     127500
13            3         77.0     127500
14            3         94.0     299000
15            4         82.0     195000
16            3         98.0     275000
17            3         83.0     210000
18            3         92.0     395000
19            3         75.0     300000
20            3         90.0     289000
21            3         96.0     550000
22            3         70.0     218000
23            3         76.0     395000
24            3         90.0     290000
25            3         98.0     270000
26            3         98.0     270000
27            3         90.0     590000
28            3         90.0     550000
29            3         90.0     550000
30            3         69.0     299000
31            3         96.0     498000
32            3         90.0     299990
33            3         82.0     399000
34            3         98.0     299000
35            3         93.0     640000

In [59]:
query = """
SELECT n_bathrooms, sq_mt_built, buy_price FROM madrid_houses 
WHERE n_bathrooms > 2 OR sq_mt_built < 100;
"""

pd.read_sql(query, con=engine)

       n_bathrooms  sq_mt_built  buy_price
0                1         64.0      85000
1                1         70.0     129900
2                2         94.0     144247
3                1         64.0     109900
4                2         84.0     212000
...            ...          ...        ...
15837            2         99.0     349000
15838            2         78.0     350000
15839            2         96.0     425000
15840            3        289.0     695000
15841            2         72.0     424000

[15842 rows x 3 columns]

In [ ]:
query = """
SELECT n_bathrooms, sq_mt_built, buy_price FROM madrid_houses 
WHERE n_bathrooms > 2 OR sq_mt_built < 100;
"""

pd.read_sql(query, con=engine)

In [60]:
query = """
SELECT * FROM madrid_houses WHERE n_bathrooms = 3 ;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,40,21702,125.0,3,3,2,0.0,7,275000,False,True,True,4,False,131,21,4
1,86,21656,140.0,3,3,2,0.0,7,272500,False,True,True,4,False,131,21,4
2,143,21599,133.0,3,3,1,0.0,7,275000,False,True,True,4,False,131,21,1
3,266,21476,125.0,3,3,1,0.0,7,275000,False,True,True,0,False,131,21,5
4,296,21446,125.0,3,3,2,0.0,1,275000,False,True,True,4,False,131,21,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2423,21720,22,334.0,5,3,4,407.0,-5,895000,False,False,True,3,True,9,2,2
2424,21721,21,362.0,6,3,3,0.0,-5,715000,False,False,True,3,False,11,2,2
2425,21730,12,289.0,5,3,3,0.0,-5,820000,False,False,True,0,True,8,2,2
2426,21733,9,267.0,5,3,2,382.0,-5,790000,False,False,True,0,True,9,2,2
2427,21740,2,289.0,4,3,3,304.0,-5,695000,False,False,True,0,True,9,2,2

In [61]:
query = """
SELECT * FROM madrid_houses WHERE n_bathrooms != 3 ;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,2,21740,94.0,2,2,1,0.0,1,144247,False,True,True,0,False,134,21,1
3,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
4,4,21738,108.0,2,2,1,0.0,4,260000,False,True,True,0,True,133,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19306,21736,6,99.0,2,2,1,0.0,1,349000,False,True,True,0,True,9,2,1
19307,21737,5,78.0,2,2,1,0.0,4,350000,False,True,True,0,True,10,2,5
19308,21738,4,96.0,2,2,1,0.0,3,425000,False,True,True,0,True,9,2,1
19309,21739,3,175.0,4,2,1,0.0,-1,680000,False,False,True,3,True,9,2,1
19310,21741,1,72.0,2,2,1,0.0,2,424000,False,True,True,7,True,3,1,1

In [72]:
query = """
SELECT * FROM madrid_houses WHERE sq_mt_built in (100, 120, 85) ;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,6,21736,120.0,5,2,1,0.0,1,190000,False,False,True,2,True,134,21,1
1,9,21733,85.0,2,1,1,0.0,7,131400,True,False,True,0,False,133,21,1
2,47,21695,120.0,3,2,1,0.0,7,298000,False,True,True,0,True,133,21,1
3,119,21623,100.0,3,2,1,0.0,3,235000,False,True,True,0,True,131,21,1
4,139,21603,85.0,3,1,1,0.0,4,138000,False,False,True,0,False,134,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
837,21394,348,100.0,4,2,1,0.0,1,195000,True,False,True,0,False,81,12,1
838,21434,308,100.0,3,1,1,0.0,3,189900,False,False,True,0,True,89,13,1
839,21469,273,120.0,2,2,1,0.0,2,144500,True,False,True,0,False,66,10,1
840,21640,102,85.0,1,1,1,0.0,2,575000,False,True,True,7,True,20,4,1
841,21727,15,100.0,3,2,1,0.0,1,328000,False,True,True,0,False,8,2,1

In [74]:
query = """
SELECT * FROM madrid_houses WHERE n_bathrooms not in (2, 4) ;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,1,21741,70.0,3,1,1,0.0,4,129900,True,True,True,0,False,132,21,1
2,3,21739,64.0,2,1,1,0.0,-1,109900,False,True,True,0,False,134,21,1
3,9,21733,85.0,2,1,1,0.0,7,131400,True,False,True,0,False,133,21,1
4,14,21728,64.0,3,1,1,0.0,3,72000,False,False,True,2,False,135,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13155,21730,12,289.0,5,3,3,0.0,-5,820000,False,False,True,0,True,8,2,2
13156,21732,10,74.0,2,1,1,0.0,0,239500,False,True,True,1,True,10,2,1
13157,21733,9,267.0,5,3,2,382.0,-5,790000,False,False,True,0,True,9,2,2
13158,21734,8,89.0,3,1,1,0.0,5,275000,False,True,True,0,False,8,2,1
13159,21740,2,289.0,4,3,3,304.0,-5,695000,False,False,True,0,True,9,2,2

In [76]:
query = """
SELECT * FROM madrid_houses WHERE has_lift = False ;
"""

pd.read_sql(query, con=engine)

,Unnamed: 0,id,sq_mt_built,n_rooms,n_bathrooms,n_floors,sq_mt_allotment,floor,buy_price,is_renewal_needed,has_lift,is_exterior,energy_certificate,has_parking,neighborhood,district,house_type
0,0,21742,64.0,2,1,1,0.0,3,85000,False,False,True,4,False,135,21,1
1,5,21737,126.0,4,2,1,0.0,3,195000,False,False,True,0,True,134,21,1
2,6,21736,120.0,5,2,1,0.0,1,190000,False,False,True,2,True,134,21,1
3,7,21735,125.0,3,2,1,0.0,2,198500,False,False,True,0,False,134,21,1
4,9,21733,85.0,2,1,1,0.0,7,131400,True,False,True,0,False,133,21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6839,21730,12,289.0,5,3,3,0.0,-5,820000,False,False,True,0,True,8,2,2
6840,21731,11,276.0,4,4,4,189.0,-5,690000,False,False,True,1,True,11,2,2
6841,21733,9,267.0,5,3,2,382.0,-5,790000,False,False,True,0,True,9,2,2
6842,21739,3,175.0,4,2,1,0.0,-1,680000,False,False,True,3,True,9,2,1
6843,21740,2,289.0,4,3,3,304.0,-5,695000,False,False,True,0,True,9,2,2

In [79]:
query = """
SELECT * FROM alumnos WHERE nombre = 'Juan' ;
"""

pd.read_sql(query, con=engine)

  alumno_id nombre apellido  edad      DNI
0        a1   Juan    Pérez    15  505023X

In [82]:
query = """
SELECT * FROM alumnos WHERE nombre != 'Juan' ;
"""

pd.read_sql(query, con=engine)

  alumno_id  nombre   apellido  edad       DNI
0        a2   María      Gómez    14   654578J
1        a3  Carlos    Sánchez    16   101545B
2        a4   Lucía  Fernández    17   202541X
3        a5  Andrés   Martínez    15  5305023W

In [90]:
query = """
SELECT * FROM alumnos WHERE nombre in ('Juan', 'María') ;
"""

pd.read_sql(query, con=engine)

  alumno_id nombre apellido  edad      DNI
0        a1   Juan    Pérez    15  505023X
1        a2  María    Gómez    14  654578J

contains í

In [104]:
query = """
SELECT * FROM alumnos WHERE nombre LIKE '%%í%%' ;
"""

pd.read_sql(query, con=engine)

  alumno_id nombre   apellido  edad      DNI
0        a2  María      Gómez    14  654578J
1        a4  Lucía  Fernández    17  202541X

contains ar

In [101]:
query = """
SELECT * FROM alumnos WHERE nombre LIKE '%%ar%%' ;
"""

pd.read_sql(query, con=engine)

  alumno_id  nombre apellido  edad      DNI
0        a2   María    Gómez    14  654578J
1        a3  Carlos  Sánchez    16  101545B

starts by J

In [107]:
query = """
SELECT * FROM alumnos WHERE nombre LIKE 'J%%' ;
"""

pd.read_sql(query, con=engine)

  alumno_id nombre apellido  edad      DNI
0        a1   Juan    Pérez    15  505023X

Ends by s

In [105]:
query = """
SELECT * FROM alumnos WHERE nombre LIKE '%%s' ;
"""

pd.read_sql(query, con=engine)

  alumno_id  nombre  apellido  edad       DNI
0        a3  Carlos   Sánchez    16   101545B
1        a5  Andrés  Martínez    15  5305023W

--- where Nombre column contains �ar� and ends by �s� :

In [103]:
query = """
SELECT * FROM alumnos WHERE nombre LIKE '%%ar%%s' ;
"""

pd.read_sql(query, con=engine)

  alumno_id  nombre apellido  edad      DNI
0        a3  Carlos  Sánchez    16  101545B

Starts with J follow by 4 strings

In [96]:
query = """
SELECT * FROM alumnos WHERE nombre like '%%J___' ; 
"""

pd.read_sql(query, con=engine)

  alumno_id nombre apellido  edad      DNI
0        a1   Juan    Pérez    15  505023X

Starts with J follow by 2 strings

In [102]:
query = """
SELECT * FROM alumnos WHERE nombre like '%%J__' ; 
"""

pd.read_sql(query, con=engine)

Empty DataFrame
Columns: [alumno_id, nombre, apellido, edad, DNI]
Index: []

---
---
---

## Number of rows that meets some condition

In [108]:
query = """
SELECT count(*) FROM madrid_houses WHERE has_lift = False ;
"""

pd.read_sql(query, con=engine)

   count
0   6844

In [109]:
query = """
SELECT count(*) FROM madrid_houses WHERE buy_price > 1000000 ;
"""

pd.read_sql(query, con=engine)

   count
0   3640

---
---
---

In [ ]:
query = """
DELETE FROM alumnos WHERE Name = 'Fabio' ;
"""

pd.read_sql(query, con=engine)